RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1D/source/pin_packages/cyhal_explorer_144_lqfp.c
/***************************************************************************//**
* \file cyhal_explorer_144_lqfp.c
*
* \brief
* Explorer device GPIO HAL header for 144-LQFP package
*
********************************************************************************
* \copyright
* (c) (2016-2022), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device_headers.h"
#include "cyhal_hw_types.h"

#if defined(_GPIO_EXPLORER_144_LQFP_H_)
#include "pin_packages/cyhal_explorer_144_lqfp.h"

/* Pin connections */
/* Connections for: canfd_ttcan_rx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_canfd_ttcan_rx[2] = {
    {0u, 0u, P16_4, P16_4_CANFD_TTCAN_RX0},
    {0u, 1u, P16_6, P16_6_CANFD_TTCAN_RX1},
};

/* Connections for: canfd_ttcan_tx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_canfd_ttcan_tx[2] = {
    {0u, 0u, P16_5, P16_5_CANFD_TTCAN_TX0},
    {0u, 1u, P16_7, P16_7_CANFD_TTCAN_TX1},
};

/* Connections for: debug600_clk_swj_swclk_tclk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_debug600_clk_swj_swclk_tclk[1] = {
    {0u, 0u, P7_6, P7_6_DEBUG600_CLK_SWJ_SWCLK_TCLK},
};

/* Connections for: debug600_rst_swj_trstn */
const cyhal_resource_pin_mapping_t cyhal_pin_map_debug600_rst_swj_trstn[1] = {
    {0u, 0u, P7_0, P7_0_DEBUG600_RST_SWJ_TRSTN},
};

/* Connections for: debug600_swj_swdio_tms */
const cyhal_resource_pin_mapping_t cyhal_pin_map_debug600_swj_swdio_tms[1] = {
    {0u, 0u, P7_5, P7_5_DEBUG600_SWJ_SWDIO_TMS},
};

/* Connections for: debug600_swj_swdoe_tdi */
const cyhal_resource_pin_mapping_t cyhal_pin_map_debug600_swj_swdoe_tdi[1] = {
    {0u, 0u, P7_2, P7_2_DEBUG600_SWJ_SWDOE_TDI},
};

/* Connections for: debug600_swj_swo_tdo */
const cyhal_resource_pin_mapping_t cyhal_pin_map_debug600_swj_swo_tdo[1] = {
    {0u, 0u, P7_1, P7_1_DEBUG600_SWJ_SWO_TDO},
};

/* Connections for: debug600_trace_clock */
const cyhal_resource_pin_mapping_t cyhal_pin_map_debug600_trace_clock[2] = {
    {0u, 0u, P12_4, P12_4_DEBUG600_TRACE_CLOCK},
    {0u, 0u, P24_0, P24_0_DEBUG600_TRACE_CLOCK},
};

/* Connections for: debug600_trace_data */
const cyhal_resource_pin_mapping_t cyhal_pin_map_debug600_trace_data[8] = {
    {0u, 0u, P4_4, P4_4_DEBUG600_TRACE_DATA0},
    {0u, 1u, P4_5, P4_5_DEBUG600_TRACE_DATA1},
    {0u, 2u, P4_6, P4_6_DEBUG600_TRACE_DATA2},
    {0u, 3u, P4_7, P4_7_DEBUG600_TRACE_DATA3},
    {0u, 0u, P12_0, P12_0_DEBUG600_TRACE_DATA0},
    {0u, 1u, P12_1, P12_1_DEBUG600_TRACE_DATA1},
    {0u, 2u, P12_2, P12_2_DEBUG600_TRACE_DATA2},
    {0u, 3u, P12_3, P12_3_DEBUG600_TRACE_DATA3},
};

/* Connections for: eth_eth_tsu_timer_cmp_val */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_eth_tsu_timer_cmp_val[1] = {
    {0u, 0u, P13_1, P13_1_ETH_ETH_TSU_TIMER_CMP_VAL},
};

/* Connections for: eth_mdc */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_mdc[1] = {
    {0u, 0u, P13_2, P13_2_ETH_MDC},
};

/* Connections for: eth_mdio */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_mdio[1] = {
    {0u, 0u, P13_3, P13_3_ETH_MDIO},
};

/* Connections for: eth_ref_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_ref_clk[1] = {
    {0u, 0u, P13_4, P13_4_ETH_REF_CLK},
};

/* Connections for: eth_rx_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_rx_clk[1] = {
    {0u, 0u, NC, HSIOM_SEL_GPIO},
};

/* Connections for: eth_rx_ctl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_rx_ctl[1] = {
    {0u, 0u, P13_5, P13_5_ETH_RX_CTL},
};

/* Connections for: eth_rx_er */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_rx_er[1] = {
    {0u, 0u, P13_0, P13_0_ETH_RX_ER},
};

/* Connections for: eth_rxd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_rxd[2] = {
    {0u, 0u, P13_6, P13_6_ETH_RXD0},
    {0u, 1u, P13_7, P13_7_ETH_RXD1},
};

/* Connections for: eth_tx_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_tx_clk[1] = {
    {0u, 0u, NC, HSIOM_SEL_GPIO},
};

/* Connections for: eth_tx_ctl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_tx_ctl[1] = {
    {0u, 0u, P12_4, P12_4_ETH_TX_CTL},
};

/* Connections for: eth_txd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_eth_txd[4] = {
    {0u, 2u, P12_0, P12_0_ETH_TXD2},
    {0u, 3u, P12_1, P12_1_ETH_TXD3},
    {0u, 0u, P12_2, P12_2_ETH_TXD0},
    {0u, 1u, P12_3, P12_3_ETH_TXD1},
};

/* Connections for: gfxss_dbi_csx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_gfxss_dbi_csx[1] = {
    {0u, 0u, P16_0, P16_0_GFXSS_DBI_CSX},
};

/* Connections for: gfxss_dbi_d */
const cyhal_resource_pin_mapping_t cyhal_pin_map_gfxss_dbi_d[8] = {
    {0u, 0u, P16_3, P16_3_GFXSS_DBI_D0},
    {0u, 1u, P16_4, P16_4_GFXSS_DBI_D1},
    {0u, 2u, P16_5, P16_5_GFXSS_DBI_D2},
    {0u, 3u, P16_6, P16_6_GFXSS_DBI_D3},
    {0u, 4u, P16_7, P16_7_GFXSS_DBI_D4},
    {0u, 5u, P17_0, P17_0_GFXSS_DBI_D5},
    {0u, 6u, P17_1, P17_1_GFXSS_DBI_D6},
    {0u, 7u, P17_2, P17_2_GFXSS_DBI_D7},
};

/* Connections for: gfxss_dbi_dcx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_gfxss_dbi_dcx[1] = {
    {0u, 0u, P16_2, P16_2_GFXSS_DBI_DCX},
};

/* Connections for: gfxss_dbi_e */
const cyhal_resource_pin_mapping_t cyhal_pin_map_gfxss_dbi_e[1] = {
    {0u, 0u, P16_1, P16_1_GFXSS_DBI_E},
};

/* Connections for: gfxss_dbi_wrx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_gfxss_dbi_wrx[1] = {
    {0u, 0u, P16_1, P16_1_GFXSS_DBI_WRX},
};

/* Connections for: gfxss_spi_csx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_gfxss_spi_csx[1] = {
    {0u, 0u, P16_0, P16_0_GFXSS_SPI_CSX},
};

/* Connections for: gfxss_spi_dcx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_gfxss_spi_dcx[1] = {
    {0u, 0u, P16_3, P16_3_GFXSS_SPI_DCX},
};

/* Connections for: gfxss_spi_dout */
const cyhal_resource_pin_mapping_t cyhal_pin_map_gfxss_spi_dout[1] = {
    {0u, 0u, P16_2, P16_2_GFXSS_SPI_DOUT},
};

/* Connections for: gfxss_spi_scl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_gfxss_spi_scl[1] = {
    {0u, 0u, P16_1, P16_1_GFXSS_SPI_SCL},
};

/* Connections for: i3c_i3c_scl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_i3c_i3c_scl[1] = {
    {0u, 0u, NC, HSIOM_SEL_GPIO},
};

/* Connections for: i3c_i3c_sda */
const cyhal_resource_pin_mapping_t cyhal_pin_map_i3c_i3c_sda[1] = {
    {0u, 0u, NC, HSIOM_SEL_GPIO},
};

/* Connections for: lpcomp_inn_comp */
const cyhal_resource_pin_mapping_t cyhal_pin_map_lpcomp_inn_comp[2] = {
    {0u, 0u, P12_1, HSIOM_SEL_GPIO},
    {0u, 1u, P12_3, HSIOM_SEL_GPIO},
};

