RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1D/source/pin_packages/cyhal_explorer_144_lqfp.c
/* Connections for: lpcomp_inp_comp */
const cyhal_resource_pin_mapping_t cyhal_pin_map_lpcomp_inp_comp[2] = {
    {0u, 0u, P12_0, HSIOM_SEL_GPIO},
    {0u, 1u, P12_2, HSIOM_SEL_GPIO},
};

/* Connections for: m0seccpuss_clk_m0sec_swd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_m0seccpuss_clk_m0sec_swd[1] = {
    {0u, 0u, P8_1, P8_1_M0SECCPUSS_CLK_M0SEC_SWD},
};

/* Connections for: m0seccpuss_m0sec_swd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_m0seccpuss_m0sec_swd[1] = {
    {0u, 0u, P8_0, P8_0_M0SECCPUSS_M0SEC_SWD},
};

/* Connections for: pass_sarmux_pads */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pass_sarmux_pads[7] = {
    {0u, 1u, P15_1, HSIOM_SEL_GPIO},
    {0u, 2u, P15_2, HSIOM_SEL_GPIO},
    {0u, 3u, P15_3, HSIOM_SEL_GPIO},
    {0u, 4u, P15_4, HSIOM_SEL_GPIO},
    {0u, 5u, P15_5, HSIOM_SEL_GPIO},
    {0u, 6u, P15_6, HSIOM_SEL_GPIO},
    {0u, 7u, P15_7, HSIOM_SEL_GPIO},
};

/* Connections for: pdm_pdm_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pdm_pdm_clk[5] = {
    {0u, 0u, P7_1, P7_1_PDM_PDM_CLK0},
    {0u, 1u, P7_3, P7_3_PDM_PDM_CLK1},
    {0u, 2u, P7_5, P7_5_PDM_PDM_CLK2},
    {0u, 4u, P8_1, P8_1_PDM_PDM_CLK4},
    {0u, 5u, P8_3, P8_3_PDM_PDM_CLK5},
};

/* Connections for: pdm_pdm_data */
const cyhal_resource_pin_mapping_t cyhal_pin_map_pdm_pdm_data[6] = {
    {0u, 0u, P7_0, P7_0_PDM_PDM_DATA0},
    {0u, 1u, P7_2, P7_2_PDM_PDM_DATA1},
    {0u, 2u, P7_4, P7_4_PDM_PDM_DATA2},
    {0u, 3u, P7_6, P7_6_PDM_PDM_DATA3},
    {0u, 4u, P8_0, P8_0_PDM_PDM_DATA4},
    {0u, 5u, P8_2, P8_2_PDM_PDM_DATA5},
};

/* Connections for: peri_tr_io_input */
/* The actual channel_num has no value to how the connection works. However, the HAL driver needs
   to know the index of the input or output trigger line. Store that in the channel_num field
   instead. */
const cyhal_resource_pin_mapping_t cyhal_pin_map_peri_tr_io_input[8] = {
    {0u, 0u, P6_0, P6_0_PERI0_TR_IO_INPUT0},
    {0u, 1u, P6_1, P6_1_PERI0_TR_IO_INPUT1},
    {0u, 2u, P6_2, P6_2_PERI0_TR_IO_INPUT2},
    {0u, 3u, P6_3, P6_3_PERI0_TR_IO_INPUT3},
    {0u, 4u, P6_4, P6_4_PERI0_TR_IO_INPUT4},
    {0u, 5u, P6_5, P6_5_PERI0_TR_IO_INPUT5},
    {0u, 6u, P6_6, P6_6_PERI0_TR_IO_INPUT6},
    {0u, 7u, P6_7, P6_7_PERI0_TR_IO_INPUT7},
};

/* Connections for: peri_tr_io_output */
/* The actual channel_num has no value to how the connection works. However, the HAL driver needs
   to know the index of the input or output trigger line. Store that in the channel_num field
   instead. */
const cyhal_resource_pin_mapping_t cyhal_pin_map_peri_tr_io_output[2] = {
    {0u, 0u, P7_0, P7_0_PERI0_TR_IO_OUTPUT0},
    {0u, 1u, P7_1, P7_1_PERI0_TR_IO_OUTPUT1},
};

/* Connections for: scb_i2c_scl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_i2c_scl[8] = {
    {0u, 0u, P6_0, P6_0_SCB0_I2C_SCL},
    {1u, 0u, P7_0, P7_0_SCB1_I2C_SCL},
    {2u, 0u, P8_0, P8_0_SCB2_I2C_SCL},
    {5u, 0u, P11_0, P11_0_SCB5_I2C_SCL},
    {6u, 0u, P12_0, P12_0_SCB6_I2C_SCL},
    {7u, 0u, P13_0, P13_0_SCB7_I2C_SCL},
    {10u, 0u, P16_0, P16_0_SCB10_I2C_SCL},
    {11u, 0u, P17_0, P17_0_SCB11_I2C_SCL},
};

/* Connections for: scb_i2c_sda */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_i2c_sda[10] = {
    {0u, 0u, P6_1, P6_1_SCB0_I2C_SDA},
    {1u, 0u, P7_1, P7_1_SCB1_I2C_SDA},
    {2u, 0u, P8_1, P8_1_SCB2_I2C_SDA},
    {3u, 0u, P9_1, P9_1_SCB3_I2C_SDA},
    {5u, 0u, P11_1, P11_1_SCB5_I2C_SDA},
    {6u, 0u, P12_1, P12_1_SCB6_I2C_SDA},
    {7u, 0u, P13_1, P13_1_SCB7_I2C_SDA},
    {9u, 0u, P15_1, P15_1_SCB9_I2C_SDA},
    {10u, 0u, P16_1, P16_1_SCB10_I2C_SDA},
    {11u, 0u, P17_1, P17_1_SCB11_I2C_SDA},
};

/* Connections for: scb_spi_m_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_clk[8] = {
    {0u, 0u, P6_0, P6_0_SCB0_SPI_CLK},
    {1u, 0u, P7_0, P7_0_SCB1_SPI_CLK},
    {2u, 0u, P8_0, P8_0_SCB2_SPI_CLK},
    {5u, 0u, P11_0, P11_0_SCB5_SPI_CLK},
    {6u, 0u, P12_0, P12_0_SCB6_SPI_CLK},
    {7u, 0u, P13_0, P13_0_SCB7_SPI_CLK},
    {10u, 0u, P16_0, P16_0_SCB10_SPI_CLK},
    {11u, 0u, P17_0, P17_0_SCB11_SPI_CLK},
};

/* Connections for: scb_spi_m_miso */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_miso[11] = {
    {0u, 0u, P6_2, P6_2_SCB0_SPI_MISO},
    {1u, 0u, P7_2, P7_2_SCB1_SPI_MISO},
    {2u, 0u, P8_2, P8_2_SCB2_SPI_MISO},
    {3u, 0u, P9_2, P9_2_SCB3_SPI_MISO},
    {4u, 0u, P10_3, P10_3_SCB4_SPI_MISO},
    {5u, 0u, P11_2, P11_2_SCB5_SPI_MISO},
    {6u, 0u, P12_2, P12_2_SCB6_SPI_MISO},
    {7u, 0u, P13_2, P13_2_SCB7_SPI_MISO},
    {9u, 0u, P15_2, P15_2_SCB9_SPI_MISO},
    {10u, 0u, P16_2, P16_2_SCB10_SPI_MISO},
    {11u, 0u, P17_2, P17_2_SCB11_SPI_MISO},
};

/* Connections for: scb_spi_m_mosi */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_mosi[11] = {
    {0u, 0u, P6_1, P6_1_SCB0_SPI_MOSI},
    {1u, 0u, P7_1, P7_1_SCB1_SPI_MOSI},
    {2u, 0u, P8_1, P8_1_SCB2_SPI_MOSI},
    {3u, 0u, P9_1, P9_1_SCB3_SPI_MOSI},
    {4u, 0u, P10_2, P10_2_SCB4_SPI_MOSI},
    {5u, 0u, P11_1, P11_1_SCB5_SPI_MOSI},
    {6u, 0u, P12_1, P12_1_SCB6_SPI_MOSI},
    {7u, 0u, P13_1, P13_1_SCB7_SPI_MOSI},
    {9u, 0u, P15_1, P15_1_SCB9_SPI_MOSI},
    {10u, 0u, P16_1, P16_1_SCB10_SPI_MOSI},
    {11u, 0u, P17_1, P17_1_SCB11_SPI_MOSI},
};

/* Connections for: scb_spi_m_select0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_select0[10] = {
    {0u, 0u, P6_3, P6_3_SCB0_SPI_SELECT0},
    {1u, 0u, P7_3, P7_3_SCB1_SPI_SELECT0},
    {2u, 0u, P8_3, P8_3_SCB2_SPI_SELECT0},
    {3u, 0u, P9_3, P9_3_SCB3_SPI_SELECT0},
    {4u, 0u, P10_4, P10_4_SCB4_SPI_SELECT0},
    {5u, 0u, P11_3, P11_3_SCB5_SPI_SELECT0},
    {6u, 0u, P12_3, P12_3_SCB6_SPI_SELECT0},
    {7u, 0u, P13_3, P13_3_SCB7_SPI_SELECT0},
    {9u, 0u, P15_3, P15_3_SCB9_SPI_SELECT0},
    {10u, 0u, P16_3, P16_3_SCB10_SPI_SELECT0},
};

/* Connections for: scb_spi_m_select1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_select1[9] = {
    {0u, 0u, P6_4, P6_4_SCB0_SPI_SELECT1},
    {1u, 0u, P7_4, P7_4_SCB1_SPI_SELECT1},
    {2u, 0u, P8_4, P8_4_SCB2_SPI_SELECT1},
    {4u, 0u, P10_5, P10_5_SCB4_SPI_SELECT1},
    {5u, 0u, P11_4, P11_4_SCB5_SPI_SELECT1},
    {6u, 0u, P12_4, P12_4_SCB6_SPI_SELECT1},
    {7u, 0u, P13_4, P13_4_SCB7_SPI_SELECT1},
    {9u, 0u, P15_4, P15_4_SCB9_SPI_SELECT1},
    {10u, 0u, P16_4, P16_4_SCB10_SPI_SELECT1},
};

/* Connections for: scb_spi_s_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_s_clk[8] = {
    {0u, 0u, P6_0, P6_0_SCB0_SPI_CLK},
    {1u, 0u, P7_0, P7_0_SCB1_SPI_CLK},
    {2u, 0u, P8_0, P8_0_SCB2_SPI_CLK},
    {5u, 0u, P11_0, P11_0_SCB5_SPI_CLK},
    {6u, 0u, P12_0, P12_0_SCB6_SPI_CLK},
    {7u, 0u, P13_0, P13_0_SCB7_SPI_CLK},
    {10u, 0u, P16_0, P16_0_SCB10_SPI_CLK},
    {11u, 0u, P17_0, P17_0_SCB11_SPI_CLK},
};

/* Connections for: scb_spi_s_miso */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_s_miso[11] = {
    {0u, 0u, P6_2, P6_2_SCB0_SPI_MISO},
    {1u, 0u, P7_2, P7_2_SCB1_SPI_MISO},
    {2u, 0u, P8_2, P8_2_SCB2_SPI_MISO},
    {3u, 0u, P9_2, P9_2_SCB3_SPI_MISO},
    {4u, 0u, P10_3, P10_3_SCB4_SPI_MISO},
    {5u, 0u, P11_2, P11_2_SCB5_SPI_MISO},
    {6u, 0u, P12_2, P12_2_SCB6_SPI_MISO},
    {7u, 0u, P13_2, P13_2_SCB7_SPI_MISO},
    {9u, 0u, P15_2, P15_2_SCB9_SPI_MISO},
    {10u, 0u, P16_2, P16_2_SCB10_SPI_MISO},
    {11u, 0u, P17_2, P17_2_SCB11_SPI_MISO},
};

