RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1D/source/pin_packages/cyhal_explorer_144_lqfp.c
/* Connections for: scb_spi_s_mosi */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_s_mosi[11] = {
    {0u, 0u, P6_1, P6_1_SCB0_SPI_MOSI},
    {1u, 0u, P7_1, P7_1_SCB1_SPI_MOSI},
    {2u, 0u, P8_1, P8_1_SCB2_SPI_MOSI},
    {3u, 0u, P9_1, P9_1_SCB3_SPI_MOSI},
    {4u, 0u, P10_2, P10_2_SCB4_SPI_MOSI},
    {5u, 0u, P11_1, P11_1_SCB5_SPI_MOSI},
    {6u, 0u, P12_1, P12_1_SCB6_SPI_MOSI},
    {7u, 0u, P13_1, P13_1_SCB7_SPI_MOSI},
    {9u, 0u, P15_1, P15_1_SCB9_SPI_MOSI},
    {10u, 0u, P16_1, P16_1_SCB10_SPI_MOSI},
    {11u, 0u, P17_1, P17_1_SCB11_SPI_MOSI},
};

/* Connections for: scb_spi_s_select0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_s_select0[10] = {
    {0u, 0u, P6_3, P6_3_SCB0_SPI_SELECT0},
    {1u, 0u, P7_3, P7_3_SCB1_SPI_SELECT0},
    {2u, 0u, P8_3, P8_3_SCB2_SPI_SELECT0},
    {3u, 0u, P9_3, P9_3_SCB3_SPI_SELECT0},
    {4u, 0u, P10_4, P10_4_SCB4_SPI_SELECT0},
    {5u, 0u, P11_3, P11_3_SCB5_SPI_SELECT0},
    {6u, 0u, P12_3, P12_3_SCB6_SPI_SELECT0},
    {7u, 0u, P13_3, P13_3_SCB7_SPI_SELECT0},
    {9u, 0u, P15_3, P15_3_SCB9_SPI_SELECT0},
    {10u, 0u, P16_3, P16_3_SCB10_SPI_SELECT0},
};

/* Connections for: scb_spi_s_select1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_s_select1[9] = {
    {0u, 0u, P6_4, P6_4_SCB0_SPI_SELECT1},
    {1u, 0u, P7_4, P7_4_SCB1_SPI_SELECT1},
    {2u, 0u, P8_4, P8_4_SCB2_SPI_SELECT1},
    {4u, 0u, P10_5, P10_5_SCB4_SPI_SELECT1},
    {5u, 0u, P11_4, P11_4_SCB5_SPI_SELECT1},
    {6u, 0u, P12_4, P12_4_SCB6_SPI_SELECT1},
    {7u, 0u, P13_4, P13_4_SCB7_SPI_SELECT1},
    {9u, 0u, P15_4, P15_4_SCB9_SPI_SELECT1},
    {10u, 0u, P16_4, P16_4_SCB10_SPI_SELECT1},
};

/* Connections for: scb_uart_cts */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_cts[10] = {
    {1u, 0u, P7_2, P7_2_SCB1_UART_CTS},
    {2u, 0u, P8_2, P8_2_SCB2_UART_CTS},
    {3u, 0u, P9_2, P9_2_SCB3_UART_CTS},
    {4u, 0u, P10_2, P10_2_SCB4_UART_CTS},
    {5u, 0u, P11_2, P11_2_SCB5_UART_CTS},
    {6u, 0u, P12_2, P12_2_SCB6_UART_CTS},
    {7u, 0u, P13_2, P13_2_SCB7_UART_CTS},
    {9u, 0u, P15_2, P15_2_SCB9_UART_CTS},
    {10u, 0u, P16_2, P16_2_SCB10_UART_CTS},
    {11u, 0u, P17_2, P17_2_SCB11_UART_CTS},
};

/* Connections for: scb_uart_rts */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_rts[9] = {
    {1u, 0u, P7_3, P7_3_SCB1_UART_RTS},
    {2u, 0u, P8_3, P8_3_SCB2_UART_RTS},
    {3u, 0u, P9_3, P9_3_SCB3_UART_RTS},
    {4u, 0u, P10_3, P10_3_SCB4_UART_RTS},
    {5u, 0u, P11_3, P11_3_SCB5_UART_RTS},
    {6u, 0u, P12_3, P12_3_SCB6_UART_RTS},
    {7u, 0u, P13_3, P13_3_SCB7_UART_RTS},
    {9u, 0u, P15_3, P15_3_SCB9_UART_RTS},
    {10u, 0u, P16_3, P16_3_SCB10_UART_RTS},
};

/* Connections for: scb_uart_rx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_rx[7] = {
    {1u, 0u, P7_0, P7_0_SCB1_UART_RX},
    {2u, 0u, P8_0, P8_0_SCB2_UART_RX},
    {5u, 0u, P11_0, P11_0_SCB5_UART_RX},
    {6u, 0u, P12_0, P12_0_SCB6_UART_RX},
    {7u, 0u, P13_0, P13_0_SCB7_UART_RX},
    {10u, 0u, P16_0, P16_0_SCB10_UART_RX},
    {11u, 0u, P17_0, P17_0_SCB11_UART_RX},
};

/* Connections for: scb_uart_tx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_tx[9] = {
    {1u, 0u, P7_1, P7_1_SCB1_UART_TX},
    {2u, 0u, P8_1, P8_1_SCB2_UART_TX},
    {3u, 0u, P9_1, P9_1_SCB3_UART_TX},
    {5u, 0u, P11_1, P11_1_SCB5_UART_TX},
    {6u, 0u, P12_1, P12_1_SCB6_UART_TX},
    {7u, 0u, P13_1, P13_1_SCB7_UART_TX},
    {9u, 0u, P15_1, P15_1_SCB9_UART_TX},
    {10u, 0u, P16_1, P16_1_SCB10_UART_TX},
    {11u, 0u, P17_1, P17_1_SCB11_UART_TX},
};

/* Connections for: sdhc_card_cmd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_cmd[2] = {
    {0u, 0u, P6_0, P6_0_SDHC0_CARD_CMD},
    {1u, 0u, P8_0, P8_0_SDHC1_CARD_CMD},
};

/* Connections for: sdhc_card_dat_3to0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_dat_3to0[8] = {
    {0u, 0u, P6_2, P6_2_SDHC0_CARD_DAT_3TO00},
    {0u, 1u, P6_3, P6_3_SDHC0_CARD_DAT_3TO01},
    {0u, 2u, P6_4, P6_4_SDHC0_CARD_DAT_3TO02},
    {0u, 3u, P6_5, P6_5_SDHC0_CARD_DAT_3TO03},
    {1u, 0u, P8_2, P8_2_SDHC1_CARD_DAT_3TO00},
    {1u, 1u, P8_3, P8_3_SDHC1_CARD_DAT_3TO01},
    {1u, 2u, P8_4, P8_4_SDHC1_CARD_DAT_3TO02},
    {1u, 3u, P8_5, P8_5_SDHC1_CARD_DAT_3TO03},
};

/* Connections for: sdhc_card_dat_7to4 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_dat_7to4[3] = {
    {1u, 0u, P8_6, P8_6_SDHC1_CARD_DAT_7TO40},
    {1u, 1u, P8_7, P8_7_SDHC1_CARD_DAT_7TO41},
    {1u, 3u, P9_1, P9_1_SDHC1_CARD_DAT_7TO43},
};

/* Connections for: sdhc_card_detect_n */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_detect_n[2] = {
    {0u, 0u, P6_6, P6_6_SDHC0_CARD_DETECT_N},
    {1u, 0u, P9_3, P9_3_SDHC1_CARD_DETECT_N},
};

/* Connections for: sdhc_card_emmc_reset_n */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_emmc_reset_n[1] = {
    {1u, 0u, P9_2, P9_2_SDHC1_CARD_EMMC_RESET_N},
};

/* Connections for: sdhc_card_if_pwr_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_if_pwr_en[2] = {
    {0u, 0u, P7_1, P7_1_SDHC0_CARD_IF_PWR_EN},
    {1u, 0u, P10_2, P10_2_SDHC1_CARD_IF_PWR_EN},
};

/* Connections for: sdhc_card_mech_write_prot */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_mech_write_prot[1] = {
    {0u, 0u, P6_7, P6_7_SDHC0_CARD_MECH_WRITE_PROT},
};

/* Connections for: sdhc_clk_card */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_clk_card[2] = {
    {0u, 0u, P6_1, P6_1_SDHC0_CLK_CARD},
    {1u, 0u, P8_1, P8_1_SDHC1_CLK_CARD},
};

/* Connections for: sdhc_io_volt_sel */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_io_volt_sel[2] = {
    {0u, 0u, P7_0, P7_0_SDHC0_IO_VOLT_SEL},
    {1u, 0u, P10_3, P10_3_SDHC1_IO_VOLT_SEL},
};

/* Connections for: sdhc_led_ctrl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_led_ctrl[1] = {
    {0u, 0u, NC, HSIOM_SEL_GPIO},
};

/* Connections for: smif_smif0_spi_select0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_smif0_spi_select0[1] = {
    {0u, 0u, P0_2, P0_2_SMIF_SMIF0_SPIHB_SELECT0},
};

/* Connections for: smif_smif0_spi_select1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_smif0_spi_select1[1] = {
    {0u, 0u, P7_0, P7_0_SMIF_SMIF0_SPIHB_SELECT1},
};

/* Connections for: smif_smif0_spi_select2 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_smif0_spi_select2[1] = {
    {0u, 0u, NC, HSIOM_SEL_GPIO},
};

/* Connections for: smif_smif0_spi_select3 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_smif0_spi_select3[1] = {
    {0u, 0u, NC, HSIOM_SEL_GPIO},
};

/* Connections for: smif_smif1_spi_select0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_smif1_spi_select0[1] = {
    {0u, 0u, P24_0, P24_0_SMIF_SMIF1_SPIHB_SELECT0},
};

