RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1D/source/pin_packages/cyhal_explorer_144_lqfp.c
/* Connections for: smif_smif1_spi_select1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_smif1_spi_select1[1] = {
    {0u, 0u, P6_6, P6_6_SMIF_SMIF1_SPIHB_SELECT1},
};

/* Connections for: smif_smif1_spi_select2 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_smif1_spi_select2[1] = {
    {0u, 0u, P6_7, P6_7_SMIF_SMIF1_SPIHB_SELECT2},
};

/* Connections for: smif_smif1_spi_select3 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_smif1_spi_select3[1] = {
    {0u, 0u, P7_1, P7_1_SMIF_SMIF1_SPIHB_SELECT3},
};

/* Connections for: tcpwm_line */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_line[98] = {
    {0u, 5u, P0_2, P0_2_TCPWM0_LINE5},
    {1u, 5u, P0_2, P0_2_TCPWM0_LINE261},
    {0u, 1u, P1_0, P1_0_TCPWM0_LINE1},
    {1u, 1u, P1_0, P1_0_TCPWM0_LINE257},
    {0u, 2u, P1_2, P1_2_TCPWM0_LINE2},
    {1u, 2u, P1_2, P1_2_TCPWM0_LINE258},
    {0u, 3u, P1_4, P1_4_TCPWM0_LINE3},
    {1u, 3u, P1_4, P1_4_TCPWM0_LINE259},
    {0u, 4u, P1_6, P1_6_TCPWM0_LINE4},
    {1u, 4u, P1_6, P1_6_TCPWM0_LINE260},
    {0u, 7u, P4_1, P4_1_TCPWM0_LINE7},
    {1u, 7u, P4_1, P4_1_TCPWM0_LINE263},
    {0u, 0u, P4_3, P4_3_TCPWM0_LINE0},
    {1u, 8u, P4_3, P4_3_TCPWM0_LINE264},
    {0u, 1u, P4_5, P4_5_TCPWM0_LINE1},
    {1u, 9u, P4_5, P4_5_TCPWM0_LINE265},
    {0u, 2u, P4_7, P4_7_TCPWM0_LINE2},
    {1u, 10u, P4_7, P4_7_TCPWM0_LINE266},
    {0u, 3u, P6_0, P6_0_TCPWM0_LINE3},
    {1u, 11u, P6_0, P6_0_TCPWM0_LINE267},
    {0u, 4u, P6_2, P6_2_TCPWM0_LINE4},
    {1u, 12u, P6_2, P6_2_TCPWM0_LINE268},
    {0u, 5u, P6_4, P6_4_TCPWM0_LINE5},
    {1u, 13u, P6_4, P6_4_TCPWM0_LINE269},
    {0u, 6u, P6_6, P6_6_TCPWM0_LINE6},
    {1u, 14u, P6_6, P6_6_TCPWM0_LINE270},
    {0u, 7u, P7_0, P7_0_TCPWM0_LINE7},
    {1u, 15u, P7_0, P7_0_TCPWM0_LINE271},
    {0u, 0u, P7_2, P7_2_TCPWM0_LINE0},
    {1u, 16u, P7_2, P7_2_TCPWM0_LINE272},
    {0u, 1u, P7_4, P7_4_TCPWM0_LINE1},
    {1u, 17u, P7_4, P7_4_TCPWM0_LINE273},
    {0u, 2u, P7_6, P7_6_TCPWM0_LINE2},
    {1u, 18u, P7_6, P7_6_TCPWM0_LINE274},
    {0u, 3u, P8_0, P8_0_TCPWM0_LINE3},
    {1u, 19u, P8_0, P8_0_TCPWM0_LINE275},
    {0u, 4u, P8_2, P8_2_TCPWM0_LINE4},
    {1u, 20u, P8_2, P8_2_TCPWM0_LINE276},
    {0u, 5u, P8_4, P8_4_TCPWM0_LINE5},
    {1u, 21u, P8_4, P8_4_TCPWM0_LINE277},
    {0u, 6u, P8_6, P8_6_TCPWM0_LINE6},
    {1u, 22u, P8_6, P8_6_TCPWM0_LINE278},
    {0u, 0u, P9_2, P9_2_TCPWM0_LINE0},
    {1u, 0u, P9_2, P9_2_TCPWM0_LINE256},
    {0u, 2u, P10_2, P10_2_TCPWM0_LINE2},
    {1u, 2u, P10_2, P10_2_TCPWM0_LINE258},
    {0u, 3u, P10_4, P10_4_TCPWM0_LINE3},
    {1u, 3u, P10_4, P10_4_TCPWM0_LINE259},
    {0u, 4u, P10_6, P10_6_TCPWM0_LINE4},
    {1u, 4u, P10_6, P10_6_TCPWM0_LINE260},
    {0u, 5u, P11_0, P11_0_TCPWM0_LINE5},
    {1u, 5u, P11_0, P11_0_TCPWM0_LINE261},
    {0u, 6u, P11_2, P11_2_TCPWM0_LINE6},
    {1u, 6u, P11_2, P11_2_TCPWM0_LINE262},
    {0u, 7u, P11_4, P11_4_TCPWM0_LINE7},
    {1u, 7u, P11_4, P11_4_TCPWM0_LINE263},
    {0u, 0u, P11_6, P11_6_TCPWM0_LINE0},
    {1u, 8u, P11_6, P11_6_TCPWM0_LINE264},
    {0u, 1u, P12_0, P12_0_TCPWM0_LINE1},
    {1u, 9u, P12_0, P12_0_TCPWM0_LINE265},
    {0u, 2u, P12_2, P12_2_TCPWM0_LINE2},
    {1u, 10u, P12_2, P12_2_TCPWM0_LINE266},
    {0u, 3u, P12_4, P12_4_TCPWM0_LINE3},
    {1u, 11u, P12_4, P12_4_TCPWM0_LINE267},
    {0u, 4u, P13_0, P13_0_TCPWM0_LINE4},
    {1u, 12u, P13_0, P13_0_TCPWM0_LINE268},
    {0u, 5u, P13_2, P13_2_TCPWM0_LINE5},
    {1u, 13u, P13_2, P13_2_TCPWM0_LINE269},
    {0u, 6u, P13_4, P13_4_TCPWM0_LINE6},
    {1u, 14u, P13_4, P13_4_TCPWM0_LINE270},
    {0u, 7u, P13_6, P13_6_TCPWM0_LINE7},
    {1u, 15u, P13_6, P13_6_TCPWM0_LINE271},
    {0u, 5u, P15_2, P15_2_TCPWM0_LINE5},
    {1u, 21u, P15_2, P15_2_TCPWM0_LINE277},
    {0u, 6u, P15_4, P15_4_TCPWM0_LINE6},
    {1u, 22u, P15_4, P15_4_TCPWM0_LINE278},
    {0u, 7u, P15_6, P15_6_TCPWM0_LINE7},
    {1u, 23u, P15_6, P15_6_TCPWM0_LINE279},
    {0u, 0u, P16_0, P16_0_TCPWM0_LINE0},
    {1u, 0u, P16_0, P16_0_TCPWM0_LINE256},
    {0u, 1u, P16_2, P16_2_TCPWM0_LINE1},
    {1u, 1u, P16_2, P16_2_TCPWM0_LINE257},
    {0u, 2u, P16_4, P16_4_TCPWM0_LINE2},
    {1u, 2u, P16_4, P16_4_TCPWM0_LINE258},
    {0u, 3u, P16_6, P16_6_TCPWM0_LINE3},
    {1u, 3u, P16_6, P16_6_TCPWM0_LINE259},
    {0u, 4u, P17_0, P17_0_TCPWM0_LINE4},
    {1u, 4u, P17_0, P17_0_TCPWM0_LINE260},
    {0u, 5u, P17_2, P17_2_TCPWM0_LINE5},
    {1u, 5u, P17_2, P17_2_TCPWM0_LINE261},
    {0u, 0u, P18_0, P18_0_TCPWM0_LINE0},
    {1u, 8u, P18_0, P18_0_TCPWM0_LINE264},
    {0u, 1u, P19_0, P19_0_TCPWM0_LINE1},
    {1u, 9u, P19_0, P19_0_TCPWM0_LINE265},
    {0u, 2u, P20_0, P20_0_TCPWM0_LINE2},
    {1u, 10u, P20_0, P20_0_TCPWM0_LINE266},
    {0u, 3u, P20_2, P20_2_TCPWM0_LINE3},
    {1u, 11u, P20_2, P20_2_TCPWM0_LINE267},
};

/* Connections for: tcpwm_line_compl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tcpwm_line_compl[94] = {
    {0u, 1u, P1_1, P1_1_TCPWM0_LINE_COMPL1},
    {1u, 1u, P1_1, P1_1_TCPWM0_LINE_COMPL257},
    {0u, 2u, P1_3, P1_3_TCPWM0_LINE_COMPL2},
    {1u, 2u, P1_3, P1_3_TCPWM0_LINE_COMPL258},
    {0u, 3u, P1_5, P1_5_TCPWM0_LINE_COMPL3},
    {1u, 3u, P1_5, P1_5_TCPWM0_LINE_COMPL259},
    {0u, 4u, P1_7, P1_7_TCPWM0_LINE_COMPL4},
    {1u, 4u, P1_7, P1_7_TCPWM0_LINE_COMPL260},
    {0u, 6u, P4_0, P4_0_TCPWM0_LINE_COMPL6},
    {1u, 6u, P4_0, P4_0_TCPWM0_LINE_COMPL262},
    {0u, 7u, P4_2, P4_2_TCPWM0_LINE_COMPL7},
    {1u, 7u, P4_2, P4_2_TCPWM0_LINE_COMPL263},
    {0u, 0u, P4_4, P4_4_TCPWM0_LINE_COMPL0},
    {1u, 8u, P4_4, P4_4_TCPWM0_LINE_COMPL264},
    {0u, 1u, P4_6, P4_6_TCPWM0_LINE_COMPL1},
    {1u, 9u, P4_6, P4_6_TCPWM0_LINE_COMPL265},
    {0u, 3u, P6_1, P6_1_TCPWM0_LINE_COMPL3},
    {1u, 11u, P6_1, P6_1_TCPWM0_LINE_COMPL267},
    {0u, 4u, P6_3, P6_3_TCPWM0_LINE_COMPL4},
    {1u, 12u, P6_3, P6_3_TCPWM0_LINE_COMPL268},
    {0u, 5u, P6_5, P6_5_TCPWM0_LINE_COMPL5},
    {1u, 13u, P6_5, P6_5_TCPWM0_LINE_COMPL269},
    {0u, 6u, P6_7, P6_7_TCPWM0_LINE_COMPL6},
    {1u, 14u, P6_7, P6_7_TCPWM0_LINE_COMPL270},
    {0u, 7u, P7_1, P7_1_TCPWM0_LINE_COMPL7},
    {1u, 15u, P7_1, P7_1_TCPWM0_LINE_COMPL271},
    {0u, 0u, P7_3, P7_3_TCPWM0_LINE_COMPL0},
    {1u, 16u, P7_3, P7_3_TCPWM0_LINE_COMPL272},
    {0u, 1u, P7_5, P7_5_TCPWM0_LINE_COMPL1},
    {1u, 17u, P7_5, P7_5_TCPWM0_LINE_COMPL273},
    {0u, 3u, P8_1, P8_1_TCPWM0_LINE_COMPL3},
    {1u, 19u, P8_1, P8_1_TCPWM0_LINE_COMPL275},
    {0u, 4u, P8_3, P8_3_TCPWM0_LINE_COMPL4},
    {1u, 20u, P8_3, P8_3_TCPWM0_LINE_COMPL276},
    {0u, 5u, P8_5, P8_5_TCPWM0_LINE_COMPL5},
    {1u, 21u, P8_5, P8_5_TCPWM0_LINE_COMPL277},
    {0u, 6u, P8_7, P8_7_TCPWM0_LINE_COMPL6},
    {1u, 22u, P8_7, P8_7_TCPWM0_LINE_COMPL278},
    {0u, 7u, P9_1, P9_1_TCPWM0_LINE_COMPL7},
    {1u, 23u, P9_1, P9_1_TCPWM0_LINE_COMPL279},
    {0u, 0u, P9_3, P9_3_TCPWM0_LINE_COMPL0},
    {1u, 0u, P9_3, P9_3_TCPWM0_LINE_COMPL256},
    {0u, 2u, P10_3, P10_3_TCPWM0_LINE_COMPL2},
    {1u, 2u, P10_3, P10_3_TCPWM0_LINE_COMPL258},
    {0u, 3u, P10_5, P10_5_TCPWM0_LINE_COMPL3},
    {1u, 3u, P10_5, P10_5_TCPWM0_LINE_COMPL259},
    {0u, 4u, P10_7, P10_7_TCPWM0_LINE_COMPL4},
    {1u, 4u, P10_7, P10_7_TCPWM0_LINE_COMPL260},
    {0u, 5u, P11_1, P11_1_TCPWM0_LINE_COMPL5},
    {1u, 5u, P11_1, P11_1_TCPWM0_LINE_COMPL261},
    {0u, 6u, P11_3, P11_3_TCPWM0_LINE_COMPL6},
    {1u, 6u, P11_3, P11_3_TCPWM0_LINE_COMPL262},
    {0u, 7u, P11_5, P11_5_TCPWM0_LINE_COMPL7},
    {1u, 7u, P11_5, P11_5_TCPWM0_LINE_COMPL263},
    {0u, 0u, P11_7, P11_7_TCPWM0_LINE_COMPL0},
    {1u, 8u, P11_7, P11_7_TCPWM0_LINE_COMPL264},
    {0u, 1u, P12_1, P12_1_TCPWM0_LINE_COMPL1},
    {1u, 9u, P12_1, P12_1_TCPWM0_LINE_COMPL265},
    {0u, 2u, P12_3, P12_3_TCPWM0_LINE_COMPL2},
    {1u, 10u, P12_3, P12_3_TCPWM0_LINE_COMPL266},
    {0u, 4u, P13_1, P13_1_TCPWM0_LINE_COMPL4},
    {1u, 12u, P13_1, P13_1_TCPWM0_LINE_COMPL268},
    {0u, 5u, P13_3, P13_3_TCPWM0_LINE_COMPL5},
    {1u, 13u, P13_3, P13_3_TCPWM0_LINE_COMPL269},
    {0u, 6u, P13_5, P13_5_TCPWM0_LINE_COMPL6},
    {1u, 14u, P13_5, P13_5_TCPWM0_LINE_COMPL270},
    {0u, 7u, P13_7, P13_7_TCPWM0_LINE_COMPL7},
    {1u, 15u, P13_7, P13_7_TCPWM0_LINE_COMPL271},
    {0u, 4u, P15_1, P15_1_TCPWM0_LINE_COMPL4},
    {1u, 20u, P15_1, P15_1_TCPWM0_LINE_COMPL276},
    {0u, 5u, P15_3, P15_3_TCPWM0_LINE_COMPL5},
    {1u, 21u, P15_3, P15_3_TCPWM0_LINE_COMPL277},
    {0u, 6u, P15_5, P15_5_TCPWM0_LINE_COMPL6},
    {1u, 22u, P15_5, P15_5_TCPWM0_LINE_COMPL278},
    {0u, 7u, P15_7, P15_7_TCPWM0_LINE_COMPL7},
    {1u, 23u, P15_7, P15_7_TCPWM0_LINE_COMPL279},
    {0u, 0u, P16_1, P16_1_TCPWM0_LINE_COMPL0},
    {1u, 0u, P16_1, P16_1_TCPWM0_LINE_COMPL256},
    {0u, 1u, P16_3, P16_3_TCPWM0_LINE_COMPL1},
    {1u, 1u, P16_3, P16_3_TCPWM0_LINE_COMPL257},
    {0u, 2u, P16_5, P16_5_TCPWM0_LINE_COMPL2},
    {1u, 2u, P16_5, P16_5_TCPWM0_LINE_COMPL258},
    {0u, 3u, P16_7, P16_7_TCPWM0_LINE_COMPL3},
    {1u, 3u, P16_7, P16_7_TCPWM0_LINE_COMPL259},
    {0u, 4u, P17_1, P17_1_TCPWM0_LINE_COMPL4},
    {1u, 4u, P17_1, P17_1_TCPWM0_LINE_COMPL260},
    {0u, 0u, P18_1, P18_1_TCPWM0_LINE_COMPL0},
    {1u, 8u, P18_1, P18_1_TCPWM0_LINE_COMPL264},
    {0u, 1u, P19_1, P19_1_TCPWM0_LINE_COMPL1},
    {1u, 9u, P19_1, P19_1_TCPWM0_LINE_COMPL265},
    {0u, 2u, P20_1, P20_1_TCPWM0_LINE_COMPL2},
    {1u, 10u, P20_1, P20_1_TCPWM0_LINE_COMPL266},
    {0u, 2u, P24_0, P24_0_TCPWM0_LINE_COMPL2},
    {1u, 10u, P24_0, P24_0_TCPWM0_LINE_COMPL266},
};

/* Connections for: tdm_tdm_rx_fsync */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tdm_tdm_rx_fsync[2] = {
    {0u, 0u, P10_2, P10_2_TDM_TDM_RX_FSYNC0},
    {0u, 1u, P11_2, P11_2_TDM_TDM_RX_FSYNC1},
};

/* Connections for: tdm_tdm_rx_mck */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tdm_tdm_rx_mck[1] = {
    {0u, 1u, P11_0, P11_0_TDM_TDM_RX_MCK1},
};

/* Connections for: tdm_tdm_rx_sck */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tdm_tdm_rx_sck[1] = {
    {0u, 1u, P11_1, P11_1_TDM_TDM_RX_SCK1},
};

/* Connections for: tdm_tdm_rx_sd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tdm_tdm_rx_sd[2] = {
    {0u, 0u, P10_3, P10_3_TDM_TDM_RX_SD0},
    {0u, 1u, P11_3, P11_3_TDM_TDM_RX_SD1},
};

/* Connections for: tdm_tdm_tx_fsync */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tdm_tdm_tx_fsync[2] = {
    {0u, 0u, P10_6, P10_6_TDM_TDM_TX_FSYNC0},
    {0u, 1u, P11_6, P11_6_TDM_TDM_TX_FSYNC1},
};

/* Connections for: tdm_tdm_tx_mck */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tdm_tdm_tx_mck[2] = {
    {0u, 0u, P10_4, P10_4_TDM_TDM_TX_MCK0},
    {0u, 1u, P11_4, P11_4_TDM_TDM_TX_MCK1},
};

/* Connections for: tdm_tdm_tx_sck */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tdm_tdm_tx_sck[2] = {
    {0u, 0u, P10_5, P10_5_TDM_TDM_TX_SCK0},
    {0u, 1u, P11_5, P11_5_TDM_TDM_TX_SCK1},
};

/* Connections for: tdm_tdm_tx_sd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_tdm_tdm_tx_sd[2] = {
    {0u, 0u, P10_7, P10_7_TDM_TDM_TX_SD0},
    {0u, 1u, P11_7, P11_7_TDM_TDM_TX_SD1},
};

#endif
